#导入库
import ctypes
from tkinter.ttk import *

# 导入 tkinter 模块
import tkinter as tk
# 导入 random 模块
import random

# 创建一个窗口对象
window = tk.Tk()

#设置缩放因子
window.tk.call('tk', 'scaling', 96/75)
# 设置窗口标题
window.title("随机抽学号")
# 设置窗口大小
window.geometry("1720x780+100+100")

# 创建一个标签对象，用于显示学号
label = tk.Label(window, text="点击按钮开始抽取", font=("Source Han Sans CN", 60))
# 将标签放置在窗口中央
label.pack()

# 创建一个列表对象，用于存储已经抽过的学号
drawn = []

# 定义一个函数，用于生成随机学号并更新标签内容
def draw():
    # 生成随机名字
    number = random.choice(['林立适迈','李铭淳','吕瑞杰','许海彬','刘逞果','唐意隆','张星涛','肖云天','彭家琦','林钰涵','唐蕊','谢诗瑶','吕欣林','房乐','邓博洋','黄铃','许梦琪','许欣灵','徐涵钰','冷欣然','林锌雨','林歆仪','石雨涵','金哲涵','唐幸','张浩','杨靖鑫','张铭泽','谢昱辰','谢子涵','高梓涵','刘鍶洋','陈雅格','刘语涵','王子义','周戈宇','代英杰','廖智文','邓麟瀚','夏杰','漆翼','李皓玥','王锶浵','钟宇恒','陈应攀','吴浩然','胡洪铭','林禹锡'])
    # 检查是否重复
    while number in drawn:
        # 如果重复就重新生成
        number = random.choice(['林立适迈','李铭淳','吕瑞杰','许海彬','刘逞果','唐意隆','张星涛','肖云天','彭家琦','林钰涵','唐蕊','谢诗瑶','吕欣林','房乐','邓博洋','黄铃','许梦琪','许欣灵','徐涵钰','冷欣然','林锌雨','林歆仪','石雨涵','金哲涵','唐幸','张浩','杨靖鑫','张铭泽','谢昱辰','谢子涵','高梓涵','刘鍶洋','陈雅格','刘语涵','王子义','周戈宇','代英杰','廖智文','邓麟瀚','夏杰','漆翼','李皓玥','王锶浵','钟宇恒','陈应攀','吴浩然','胡洪铭','林禹锡'])
    # 将不重复的学号添加到列表中
    drawn.append(number)
    # 将标签内容设置为随机学号
    label.config(text=str(number))

# 创建一个按钮对象，用于触发抽取函数
button = tk.Button(window, text="再抽一次", command=draw,height = 5, width = 20, font=("Source Han Sans CN", 30))
# 将按钮放置在窗口底部
button.pack(side=tk.BOTTOM)

# 进入主循环，等待用户操作
window.mainloop()
